/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 50617
Source Host           : localhost:3306
Source Database       : new_hr_qa2

Target Server Type    : MYSQL
Target Server Version : 50617
File Encoding         : 65001

Date: 2017-04-18 12:59:55
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `rv_staff`
-- ----------------------------
DROP TABLE IF EXISTS `rv_staff`;
CREATE TABLE `rv_staff` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `staff_no` varchar(5) COLLATE utf8_unicode_ci NOT NULL COMMENT '員工工號',
  `title` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL COMMENT '職類',
  `title_id` int(2) DEFAULT '1',
  `post` varchar(50) COLLATE utf8_unicode_ci NOT NULL COMMENT '職務',
  `post_id` int(2) DEFAULT '1',
  `name` varchar(50) COLLATE utf8_unicode_ci NOT NULL COMMENT '中文性名',
  `name_en` varchar(50) COLLATE utf8_unicode_ci NOT NULL COMMENT '英文性名',
  `account` varchar(50) COLLATE utf8_unicode_ci NOT NULL COMMENT '登入帳號',
  `passwd` varchar(50) COLLATE utf8_unicode_ci NOT NULL DEFAULT '12121212' COMMENT '登入密碼',
  `email` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL COMMENT '聯絡用郵件地址',
  `lv` int(2) NOT NULL COMMENT '組織階層 米奇開始為1，Eric 為2.....依此類推',
  `first_day` date NOT NULL DEFAULT '0000-00-00' COMMENT '到職日',
  `last_day` date DEFAULT '0000-00-00' COMMENT '離職日',
  `update_date` date DEFAULT '0000-00-00' COMMENT '最後更新日期',
  `status` enum('約聘','試用','正式','離職') COLLATE utf8_unicode_ci NOT NULL DEFAULT '試用' COMMENT '在職狀態',
  `status_id` int(2) DEFAULT '1',
  `department_id` int(11) NOT NULL DEFAULT '0',
  `is_leader` int(2) NOT NULL DEFAULT '0' COMMENT '是否為單位長',
  `is_admin` int(2) NOT NULL DEFAULT '0' COMMENT '是否為管理者',
  `rank` int(6) DEFAULT '0',
  PRIMARY KEY (`id`),
  UNIQUE KEY `staff_no` (`staff_no`)
) ENGINE=InnoDB AUTO_INCREMENT=236 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of rv_staff
-- ----------------------------
INSERT INTO `rv_staff` VALUES ('1', 'R001', '決策人員', '1', '經理', '1', '侯統揚', 'Mickey', 'mickey.hou', '24962821', 'mickey.hou@rv88.tw', '1', '2012-11-01', '0000-00-00', '0000-00-00', '正式', '1', '1', '1', '0', '13');
INSERT INTO `rv_staff` VALUES ('2', 'R019', '部級主管', '2', '經理', '1', '蘇穎珊', 'Susan', 'susan.su', '24962821', 'susan.su@rv88.tw', '2', '2013-12-02', '0000-00-00', '0000-00-00', '正式', '1', '2', '1', '1', '9');
INSERT INTO `rv_staff` VALUES ('3', 'R050', '一般人員(行政/專技)', '5', '資深人資專員', '3', '吳美君', 'Mavis', 'mavis.wu', '24962821', 'mavis.wu@rv88.tw', '5', '2015-04-01', '0000-00-00', '0000-00-00', '正式', '1', '13', '0', '1', '4');
INSERT INTO `rv_staff` VALUES ('4', 'R115', '一般人員(行政/專技)', '5', '行政人員', '5', '鄧幼華', 'Liz', 'liz.teng', '', 'liz.teng@rv88.tw', '5', '2016-03-17', '2017-02-12', '0000-00-00', '離職', '4', '7', '0', '1', '3');
INSERT INTO `rv_staff` VALUES ('5', 'R031', '部級主管', '2', '經理', '1', '林子雲', 'Eric', 'eric.lin', '24962821', 'eric.lin@rv88.tw', '2', '2014-12-01', '0000-00-00', '0000-00-00', '正式', '1', '6', '1', '0', '9');
INSERT INTO `rv_staff` VALUES ('6', 'R010', '一般人員(行政/專技)', '5', '客服專員', '11', '王姸茹', 'Zoe', 'zoe.wang', '', 'zoe.wang@rv88.tw', '5', '2013-04-15', '0000-00-00', '0000-00-00', '正式', '1', '20', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('7', 'R020', '組長', '4', '組長', '19', '李威揚', 'Vincent', 'vincent.lee', '24962821', 'vincent.lee@rv88.tw', '4', '2014-04-09', '0000-00-00', '0000-00-00', '正式', '1', '20', '1', '0', '6');
INSERT INTO `rv_staff` VALUES ('8', 'R027', '一般人員(行政/專技)', '5', '客服專員', '11', '林欣馨', 'Shin', 'shin.lin', '', 'shin.lin@rv88.tw', '5', '2014-10-01', '0000-00-00', '0000-00-00', '正式', '1', '20', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('9', 'R033', '一般人員(行政/專技)', '5', '客服專員', '11', '朱書賢', 'Kevin', 'kevin.chu', '', 'kevin.chu@rv88.tw', '5', '2014-12-02', '0000-00-00', '0000-00-00', '正式', '1', '20', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('10', 'R116', '一般人員(行政/專技)', '5', '客服專員', '11', '李孝龍', 'Bruce', 'bruce.lee', '', 'bruce.lee@rv88.tw', '5', '2016-03-21', '0000-00-00', '0000-00-00', '正式', '1', '20', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('11', 'R015', '一般人員(行政/專技)', '5', '客服專員', '11', '甘博仁', 'Ken', 'ken.kan', '', 'ken.kan@rv88.tw', '5', '2013-10-02', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('12', 'R017', '一般人員(行政/專技)', '5', '客服專員', '11', '黃忠信', 'Jeff', 'jeff.huang', '', 'jeff.huang@rv88.tw', '5', '2013-11-12', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('13', 'R022', '一般人員(行政/專技)', '5', '客服專員', '11', '林世創', 'Strong', 'strong.lin', '', 'strong.lin@rv88.tw', '5', '2014-08-04', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('14', 'R023', '一般人員(行政/專技)', '5', '客服專員', '11', '楊麗萍', 'Crystal', 'crystal.yang', '', 'crystal.yang@rv88.tw', '5', '2014-08-04', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('15', 'R024', '組長', '4', '組長', '19', '許雅玲', 'Rita', 'rita.hsu', '24962821', 'rita.hsu@rv88.tw', '4', '2014-08-04', '0000-00-00', '0000-00-00', '正式', '1', '17', '1', '0', '6');
INSERT INTO `rv_staff` VALUES ('16', 'R025', '一般人員(行政/專技)', '5', '客服專員', '11', '林碩人', 'David', 'david.lin', '', 'david.lin@rv88.tw', '5', '2014-08-04', '2017-03-14', '0000-00-00', '離職', '4', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('17', 'R032', '一般人員(行政/專技)', '5', '客服專員', '11', '高君龢', 'Herman', 'herman.gao', '', 'herman.gao@rv88.tw', '5', '2014-12-02', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('18', 'R041', '一般人員(行政/專技)', '5', '客服專員', '11', '廖逸楷', 'Kai', 'kai.liao', '', 'kai.liao@rv88.tw', '5', '2015-01-07', '2017-01-31', '0000-00-00', '離職', '4', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('19', 'R042', '一般人員(行政/專技)', '5', '客服專員', '11', '蔣雄貴', 'Kuei', 'kuei.jiang', '', 'kuei.jiang@rv88.tw', '5', '2015-01-07', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('20', 'R043', '一般人員(行政/專技)', '5', '客服專員', '11', '鄒宜君', 'Candy', 'candy.tsou', '', 'candy.tsou@rv88.tw', '5', '2015-01-07', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('21', 'R044', '一般人員(行政/專技)', '5', '客服專員', '11', '余佩霖', 'Peilin', 'peilin.yu', '', 'peilin.yu@rv88.tw', '5', '2015-01-07', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('22', 'R046', '一般人員(行政/專技)', '5', '客服專員', '11', '林育賢', 'Matt', 'matt.lin', '', 'matt.lin@rv88.tw', '5', '2015-01-19', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('23', 'R047', '一般人員(行政/專技)', '5', '客服專員', '11', '鍾瀅', 'Saya', 'saya.zhun', '', 'zhun.saya@rv88.tw', '5', '2015-03-04', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('24', 'R055', '一般人員(行政/專技)', '5', '客服專員', '11', '譚奇勝', 'Jacob', 'jacob.tan', '', 'jacob.tan@rv88.tw', '5', '2015-04-07', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('25', 'R056', '一般人員(行政/專技)', '5', '稽核專員', '9', '高薇雯', 'Evelyn', 'evelyn.kao', '', 'evelyn.kao@rv88.tw', '5', '2015-04-07', '0000-00-00', '2017-01-23', '正式', '1', '15', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('27', 'R075', '一般人員(行政/專技)', '5', '客服專員', '11', '洪廷霖', 'Lin', 'lin.hong', '', 'lin.hong@rv88.tw', '5', '2015-07-14', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('28', 'R082', '一般人員(行政/專技)', '5', '客服專員', '11', '林宛諭', 'Alison', 'alison.lin', '', 'alison.lin@rv88.tw', '5', '2015-08-03', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('29', 'R100', '一般人員(行政/專技)', '5', '客服專員', '11', '葉庭瑋', 'Willie', 'willie.yeh', '', 'willie.yeh@rv88.tw', '5', '2015-10-05', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('30', 'R104', '一般人員(行政/專技)', '5', '客服專員', '11', '黃志衡', 'George', 'george.huang', '', 'george.huang@rv88.tw', '5', '2015-11-02', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('31', 'R125', '一般人員(行政/專技)', '5', '客服專員', '11', '徐澄', 'Raven', 'raven.hsu', '', 'raven.hsu@rv88.tw', '5', '2016-06-01', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('32', 'R128', '一般人員(行政/專技)', '5', '稽核專員', '9', '丁于希', 'Yusi', 'yusi.ting', '', 'yusi.ting@rv88.tw', '5', '2016-06-13', '0000-00-00', '0000-00-00', '正式', '1', '15', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('33', 'R013', '組長', '4', '組長', '19', '焦小紅', 'Jessie', 'jessie.chiao', '24962821', 'jessie.chiao@rv88.tw', '4', '2013-08-01', '0000-00-00', '0000-00-00', '正式', '1', '24', '1', '0', '6');
INSERT INTO `rv_staff` VALUES ('34', 'R072', '轉正人員', '9', '助理', '12', '陳星羽', 'Annie', 'annie.chen', '', 'annie.chen@rv88.tw', '5', '2015-07-13', '0000-00-00', '0000-00-00', '正式', '1', '24', '0', '0', '1');
INSERT INTO `rv_staff` VALUES ('35', 'R080', '轉正人員', '9', '助理', '12', '張奇勳', 'Tristan', 'tristan.chang', '', 'tristan.chang@rv88.tw', '5', '2015-07-23', '0000-00-00', '0000-00-00', '正式', '1', '24', '0', '0', '1');
INSERT INTO `rv_staff` VALUES ('39', 'R109', '一般人員(行政/專技)', '5', '客服專員', '11', '李洪彰', 'Moore', 'moore.lee', '', 'moore.lee@rv88.tw', '5', '2015-11-11', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('41', 'R111', '一般人員(行政/專技)', '5', '客服專員', '11', '袁書豪', 'White', 'white.yuan', '', 'white.yuan@rv88.tw', '5', '2015-12-14', '0000-00-00', '2017-03-01', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('49', 'R029', '一般人員(行政/專技)', '5', '系統工程師', '8', '黃瑞龍', 'Ray', 'ray.huang', '', 'ray.huang@rv88.tw', '5', '2014-11-04', '0000-00-00', '0000-00-00', '正式', '1', '21', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('50', 'R106', '一般人員(行政/專技)', '5', '系統工程師', '8', '陳禹豪', 'David', 'david.chen', '', 'david.chen@rv88.tw', '5', '2015-11-02', '0000-00-00', '0000-00-00', '正式', '1', '21', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('52', 'R006', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '全士芃', 'Peter', 'peter.chuang', '', 'peter.chuang@rv88.tw', '5', '2013-03-04', '0000-00-00', '0000-00-00', '正式', '1', '19', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('53', 'R007', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '林子翔', 'Poki', 'poki.lin', '', 'poki.lin@rv88.tw', '5', '2013-04-01', '0000-00-00', '2017-03-21', '正式', '1', '22', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('54', 'R008', '組長', '4', '組長', '19', '黃海威', 'Turtle', 'turtle.huang', '24962821', 'turtle.huang@rv88.tw', '4', '2013-04-01', '0000-00-00', '0000-00-00', '正式', '1', '19', '1', '0', '6');
INSERT INTO `rv_staff` VALUES ('55', 'R011', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '何俊達', 'Dada', 'dada.ho', '', 'dadazax.ho@rv88.tw', '5', '2013-05-02', '0000-00-00', '0000-00-00', '正式', '1', '19', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('56', 'R026', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '趙祐晟', 'Johnson', 'johnson.chao', '', 'johnson.chao@rv88.tw', '5', '2014-10-01', '0000-00-00', '0000-00-00', '正式', '1', '19', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('57', 'R059', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '陳昱丞', 'Yuchen', 'yuchen.chen', '', 'yuchen.chen@rv88.tw', '5', '2015-04-15', '0000-00-00', '0000-00-00', '正式', '1', '19', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('58', 'R063', '其他職員', '7', '助理', '12', '黃心潔', 'Lulu', 'lulu.huang', '', 'lulu.huang@rv88.tw', '5', '2015-05-11', '2017-01-31', '0000-00-00', '離職', '4', '15', '0', '0', '2');
INSERT INTO `rv_staff` VALUES ('59', 'R094', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '王智威', 'Peter', 'peter.wang', '', 'peter.wang@rv88.tw', '5', '2015-09-14', '0000-00-00', '0000-00-00', '正式', '1', '19', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('60', 'R113', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '張士駿', 'Grey', 'grey.chang', '', 'grey.chang@rv88.tw', '5', '2016-03-01', '0000-00-00', '0000-00-00', '正式', '1', '19', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('62', 'R120', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '郭庭維', 'Duke', 'duke.kuo', '', 'duke.kuo@rv88.tw', '5', '2016-05-03', '0000-00-00', '0000-00-00', '正式', '1', '18', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('65', 'R123', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '賴佳昌', 'Exia', 'exia.lai', '', 'exia.lai@rv88.tw', '5', '2016-05-16', '0000-00-00', '0000-00-00', '正式', '1', '19', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('66', 'R049', '組長', '4', '組長', '19', '宋長洲', 'Ryan', 'ryan.sung', '24962821', 'ryan.sung@rv88.tw', '4', '2015-03-09', '0000-00-00', '0000-00-00', '正式', '1', '22', '1', '0', '6');
INSERT INTO `rv_staff` VALUES ('67', 'R069', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '許嘉維', 'Vic', 'vic.hsu', '', 'vic.hsu@rv88.tw', '5', '2015-07-13', '0000-00-00', '0000-00-00', '正式', '1', '22', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('68', 'R021', '組長', '4', '組長', '19', '楊伯麟', 'Luke', 'luke.yang', '24962821', 'luke.yang@rv88.tw', '4', '2014-06-18', '2017-04-16', '0000-00-00', '離職', '4', '25', '1', '0', '6');
INSERT INTO `rv_staff` VALUES ('69', 'R052', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '林永鋒', 'Dennis', 'dennis.lin', '', 'dennis.lin@rv88.tw', '5', '2015-04-01', '0000-00-00', '0000-00-00', '正式', '1', '25', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('70', 'R018', '組長', '4', '組長', '19', '邱柏洋', 'Quake', 'quake.chiu', '24962821', 'quake.chiu@rv88.tw', '4', '2013-12-02', '0000-00-00', '0000-00-00', '正式', '1', '18', '1', '0', '6');
INSERT INTO `rv_staff` VALUES ('71', 'R002', '組長', '4', '組長', '19', '張裕', 'Richard', 'richard.chang', '24962821', 'richard.chang@rv88.tw', '4', '2012-11-01', '0000-00-00', '0000-00-00', '正式', '1', '16', '1', '0', '6');
INSERT INTO `rv_staff` VALUES ('72', 'R053', '一般人員(行政/專技)', '5', '資料庫操作員', '14', '徐銘鴻', 'Leo', 'leo.hsu', '', 'leo.hsu@rv88.tw', '5', '2015-04-07', '0000-00-00', '0000-00-00', '正式', '1', '16', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('73', 'R067', '一般人員(行政/專技)', '5', '資料庫管理工程師', '4', '王嘉偉', 'Falcon', 'falcon.wang', '', 'falcon.wang@rv88.tw', '5', '2015-07-01', '0000-00-00', '0000-00-00', '正式', '1', '16', '0', '0', '4');
INSERT INTO `rv_staff` VALUES ('76', 'R034', '一般人員(行政/專技)', '5', '網頁設計師', '6', '吳敏絹', 'Joan', 'joan.wu', '', 'joan.wu@rv88.tw', '5', '2014-12-02', '0000-00-00', '0000-00-00', '正式', '1', '23', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('77', 'R036', '組長', '4', '組長', '19', '賴政男', 'Jemmy', 'jemmy.lai', '24962821', 'jemmy.lai@rv88.tw', '4', '2014-12-15', '2017-01-31', '0000-00-00', '離職', '4', '23', '0', '0', '6');
INSERT INTO `rv_staff` VALUES ('78', 'R039', '一般人員(行政/專技)', '5', '網頁程式設計師', '7', '張景翔', 'Chris', 'chris.chang', '', 'chris.chang@rv88.tw', '5', '2014-12-16', '0000-00-00', '0000-00-00', '正式', '1', '23', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('79', 'R040', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '陳家德', 'Jader', 'jader.chen', '', 'jader.chen@rv88.tw', '5', '2014-12-22', '0000-00-00', '2017-02-20', '正式', '1', '25', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('80', 'R058', '組長', '4', '組長', '19', '莊格維', 'Snow', 'snow.jhung', '24962821', 'snow.jhung@rv88.tw', '4', '2015-04-13', '0000-00-00', '0000-00-00', '正式', '1', '23', '1', '0', '6');
INSERT INTO `rv_staff` VALUES ('81', 'R064', '一般人員(行政/專技)', '5', '網頁程式設計師', '7', '程晉鴻', 'Castle', 'castle.cheng', '', 'castle.cheng@rv88.tw', '5', '2015-06-01', '0000-00-00', '0000-00-00', '正式', '1', '23', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('82', 'R066', '一般人員(行政/專技)', '5', '網頁程式設計師', '7', '戴妙妃', 'Sophia', 'sophia.tai', '', 'sophia.tai@rv88.tw', '5', '2015-06-22', '0000-00-00', '0000-00-00', '正式', '1', '23', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('83', 'R096', '一般人員(行政/專技)', '5', '網頁程式設計師', '7', '朱德溎', 'Wade', 'wade.zhu', '', 'wade.zhu@rv88.tw', '5', '2015-09-21', '0000-00-00', '0000-00-00', '正式', '1', '23', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('85', 'R009', '處級主管', '3', '處長', '18', '楊劭儀', 'Hako', 'hako.yang', '24962821', 'hako.yang@rv88.tw', '3', '2013-04-15', '0000-00-00', '0000-00-00', '正式', '1', '15', '1', '0', '7');
INSERT INTO `rv_staff` VALUES ('86', 'R035', '一般人員(行政/專技)', '5', '稽核專員', '9', '陳孟成', 'Roy', 'roy.chen', '', 'roy.chen@rv88.tw', '5', '2014-12-02', '0000-00-00', '0000-00-00', '正式', '1', '15', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('87', 'R037', '一般人員(行政/專技)', '5', '稽核專員', '9', '黃子寧', 'Ruiza', 'ruiza.huang', '', 'ruiza.huang@rv88.tw', '5', '2014-12-15', '0000-00-00', '0000-00-00', '正式', '1', '15', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('89', 'R139', '一般人員(行政/專技)', '5', '網頁設計師', '6', '林威逸', 'Bryan', 'bryan.lin', '', 'bryan.lin@rv88.tw', '5', '2016-08-03', '0000-00-00', '0000-00-00', '正式', '1', '23', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('100', 'R133', '一般人員(行政/專技)', '5', '客服專員', '11', '李政庭', 'Tim', 'tim.lee', '', 'tim.lee@rv88.tw', '5', '2016-07-04', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('103', 'R136', '一般人員(行政/專技)', '5', '客服專員', '11', '陳葭', 'Jasmine', 'jasmine.chen', '', 'jasmine.chen@rv88.tw', '5', '2016-07-18', '0000-00-00', '0000-00-00', '正式', '1', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('106', 'R141', '約聘人員', '6', '工讀生', '13', '鄭嘉宏', 'Red', 'red.cheng', '', 'red.cheng@rv88.tw', '6', '2016-08-29', '2017-02-26', '0000-00-00', '離職', '4', '24', '0', '0', '0');
INSERT INTO `rv_staff` VALUES ('108', 'R144', '約聘人員', '6', '工讀生', '13', '周晉平', 'Leo', 'leo.chou', '', 'leo.chou@rv88.tw', '6', '2016-08-31', '2017-02-27', '0000-00-00', '離職', '4', '24', '0', '0', '0');
INSERT INTO `rv_staff` VALUES ('111', 'R147', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '蔡偉豪', 'Andy', 'andy.tsai', '', 'andy.tsai@rv88.tw', '5', '2016-09-05', '0000-00-00', '2017-03-01', '正式', '1', '18', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('116', 'R148', '一般人員(行政/專技)', '5', '風控專員', '15', '吳雅雯', 'Lucy', 'lucy.wu', '', 'lucy.wu@rv88.tw', '5', '2016-09-19', '0000-00-00', '2017-03-01', '正式', '1', '10', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('120', 'R150', '約聘人員', '6', '工讀生', '13', '林榆傑', 'Jay', 'jay.lin', '', 'jay.lin@rv88.tw', '6', '2016-10-03', '2017-04-09', '0000-00-00', '離職', '4', '24', '0', '0', '0');
INSERT INTO `rv_staff` VALUES ('121', 'R152', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '馬瑞成', 'Ricky', 'ricky.ma', '', 'ricky.ma@rv88.tw', '5', '2016-10-11', '0000-00-00', '2017-02-20', '正式', '1', '18', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('124', 'R045', '一般人員(行政/專技)', '5', '風控專員', '15', '張振華', 'Walter', 'walter.chang', '', 'walter.chang@rv88.tw', '5', '2015-01-07', '0000-00-00', '0000-00-00', '正式', '1', '10', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('147', 'R154', '一般人員(行政/專技)', '5', '系統工程師', '8', '洪辰錐', 'CJ', 'cj.hung', '', 'cj.hung@rv88.tw', '5', '2016-10-24', '2017-02-03', '0000-00-00', '離職', '4', '21', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('148', 'R155', '約聘人員', '6', '工讀生', '13', '楊東諺', 'DonYan', 'donyan.yang', '', 'donyan.yang@rv88.tw', '6', '2016-10-24', '0000-00-00', '0000-00-00', '約聘', '2', '24', '0', '0', '0');
INSERT INTO `rv_staff` VALUES ('149', 'R156', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '楊程筑', 'Eric', 'eric.yang', '', 'eric.yang@rv88.tw', '5', '2016-11-01', '0000-00-00', '0000-00-00', '正式', '1', '18', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('150', 'R157', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '李承哲', 'Fred', 'fred.lee', '', 'fred.lee@rv88.tw', '5', '2016-11-01', '0000-00-00', '0000-00-00', '正式', '1', '18', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('199', 'R158', '約聘人員', '6', '工讀生', '13', '林鼎鈞', 'Jun', 'jun.lin', '', 'jun.lin@rv88.tw', '6', '2016-11-21', '0000-00-00', '0000-00-00', '約聘', '2', '24', '0', '0', '0');
INSERT INTO `rv_staff` VALUES ('201', 'R160', '約聘人員', '6', '工讀生', '13', '林哲賢', 'Jack', 'jack.lin', '', 'jack.lin@rv88.tw', '6', '2016-11-25', '2017-02-23', '0000-00-00', '離職', '4', '24', '0', '0', '0');
INSERT INTO `rv_staff` VALUES ('202', 'R161', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '林佳穎', 'Joseph', 'joseph.lin', '', 'joseph.lin@rv88.tw', '5', '2016-12-01', '0000-00-00', '0000-00-00', '正式', '1', '25', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('203', 'R162', '一般人員(行政/專技)', '5', '風控專員', '15', '陳時仲', 'Aries', 'aries.chen', '', 'aries.chen@rv88.tw', '5', '2016-12-01', '0000-00-00', '0000-00-00', '正式', '1', '10', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('204', 'R163', '約聘人員', '6', '工讀生', '13', '袁書慧', 'Piggy', 'piggy.yuan', '', 'piggy.yuan@rv88.tw', '6', '2016-12-20', '0000-00-00', '0000-00-00', '約聘', '2', '24', '0', '0', '0');
INSERT INTO `rv_staff` VALUES ('205', 'R164', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '謝文中', 'Donem', 'donem.hsieh', '', 'donem.hsieh@rv88.tw', '5', '2017-01-09', '0000-00-00', '0000-00-00', '正式', '1', '19', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('213', 'R165', '一般人員(行政/專技)', '5', '系統工程師', '8', '張超', 'Eric', 'eric.zhang', '', 'eric.zhang@rv88.tw', '5', '2017-02-02', '2017-02-28', '0000-00-00', '離職', '4', '21', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('214', 'R170', '一般人員(行政/專技)', '5', '行政人員', '5', '陳幸玉', 'Jade', 'jade.chen', '', 'jade.chen@rv88.tw', '5', '2017-02-13', '0000-00-00', '0000-00-00', '試用', '3', '7', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('215', 'R176', '一般人員(行政/專技)', '5', '客服專員', '11', '余采疄', 'Cailin', 'cailin.yu', '', 'cailin.yu@rv88.tw', '5', '2017-03-01', '0000-00-00', '0000-00-00', '試用', '3', '6', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('216', 'R177', '一般人員(行政/專技)', '5', '客服專員', '11', '張愷倫', 'Karen', 'karen.chang', '', 'karen.chang@rv88.tw', '5', '2017-03-01', '0000-00-00', '0000-00-00', '試用', '3', '6', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('217', 'R167', '一般人員(行政/專技)', '5', '客服專員', '11', '吳冠伶', 'Ling', 'ling.wu', '', 'ling.wu@rv88.tw', '5', '2017-02-06', '0000-00-00', '0000-00-00', '試用', '3', '20', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('218', 'R174', '一般人員(行政/專技)', '5', '客服專員', '11', '阮宗哲', 'Kevin', 'kevin.yuen', '', 'kevin.yuen@rv88.tw', '5', '2017-02-20', '0000-00-00', '0000-00-00', '試用', '3', '20', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('219', 'R181', '一般人員(行政/專技)', '5', '客服專員', '11', '陳銘', 'Flex', 'flex.chen', '', 'flex.chen@rv88.tw', '5', '2017-04-05', '0000-00-00', '0000-00-00', '試用', '3', '20', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('220', 'R168', '一般人員(行政/專技)', '5', '客服專員', '11', '洪靖旻', 'Zoe', 'zoe.hung', '', 'jine-min.hung@rv88.tw', '5', '2017-02-06', '0000-00-00', '0000-00-00', '試用', '3', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('221', 'R178', '一般人員(行政/專技)', '5', '客服專員', '11', '陳孟伶', 'Lynn', 'lynn.chen', '', 'lynn.chen@rv88.tw', '5', '2017-03-01', '0000-00-00', '0000-00-00', '試用', '3', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('222', 'R179', '一般人員(行政/專技)', '5', '客服專員', '11', '李家維', 'Vic', 'vic.lee', '', 'vic.lee@rv88.tw', '5', '2017-03-01', '0000-00-00', '0000-00-00', '試用', '3', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('223', 'R182', '一般人員(行政/專技)', '5', '客服專員', '11', '楊詠蓁', 'Joy', 'joy.yang', '', 'joy.yang@rv88.tw', '5', '2017-04-05', '0000-00-00', '0000-00-00', '試用', '3', '17', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('224', 'R171', '約聘人員', '6', '工讀生', '13', '施宗甫', 'Eric', 'eric.shih', '', 'eric.shih@rv88.tw', '6', '2017-02-15', '0000-00-00', '0000-00-00', '約聘', '2', '24', '0', '0', '0');
INSERT INTO `rv_staff` VALUES ('225', 'R172', '約聘人員', '6', '工讀生', '13', '黃敏哲', 'Egan', 'egan.huang', '', 'egan.huang@rv88.tw', '6', '2017-02-20', '0000-00-00', '0000-00-00', '約聘', '2', '24', '0', '0', '0');
INSERT INTO `rv_staff` VALUES ('226', 'R173', '約聘人員', '6', '工讀生', '13', '黃忠政', 'Sky', 'sky.huang', '', 'sky.huang@rv88.tw', '6', '2017-02-20', '0000-00-00', '0000-00-00', '約聘', '2', '24', '0', '0', '0');
INSERT INTO `rv_staff` VALUES ('227', 'R175', '約聘人員', '6', '工讀生', '13', '陳宥達', 'Simon', 'simon.chen', '', 'simon.chen@rv88.tw', '6', '2017-02-21', '0000-00-00', '0000-00-00', '約聘', '2', '24', '0', '0', '0');
INSERT INTO `rv_staff` VALUES ('228', 'R180', '約聘人員', '6', '工讀生', '13', '林旻諺', 'MingYang', 'mingyang.lin', '', 'ming-yang.lin@rv88.tw', '6', '2017-03-28', '0000-00-00', '0000-00-00', '約聘', '2', '24', '0', '0', '0');
INSERT INTO `rv_staff` VALUES ('229', 'R183', '一般人員(行政/專技)', '5', '系統工程師', '8', '蕭睿廷', 'Ryan', 'ryan.hsiao', '', 'ryan.hsiao@rv88.tw', '5', '2017-04-05', '0000-00-00', '0000-00-00', '試用', '3', '21', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('230', 'R184', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '李宗振', 'Tsung', 'tsung.lee', '', 'tsung.lee@rv88.tw', '5', '2017-04-05', '0000-00-00', '0000-00-00', '試用', '3', '19', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('231', 'R185', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '許玉暉', 'Henry', 'henry.hsu', '', 'henry.hsu@rv88.tw', '5', '2017-04-05', '0000-00-00', '0000-00-00', '試用', '3', '19', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('232', 'R186', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '曾彥嘉', 'Jack', 'jack.zeng', '', 'jack.zeng@rv88.tw', '5', '2017-04-05', '0000-00-00', '0000-00-00', '試用', '3', '19', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('233', 'R166', '一般人員(行政/專技)', '5', '風控專員', '15', '陳彥傑', 'Ian', 'ian.chen', '', 'ian.chen@rv88.tw', '5', '2017-02-02', '0000-00-00', '0000-00-00', '試用', '3', '10', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('234', 'R169', '一般人員(行政/專技)', '5', '風控專員', '15', '林明葆', 'Jimmy', 'jimmy.lin', '', 'jimmy.lin@rv88.tw', '5', '2017-02-06', '0000-00-00', '0000-00-00', '試用', '3', '10', '0', '0', '3');
INSERT INTO `rv_staff` VALUES ('235', 'R187', '一般人員(行政/專技)', '5', '技術支援工程師', '10', '王彥翔', 'David', 'david.wang', '', 'david.wang@rv88.tw', '5', '2017-04-17', '0000-00-00', '0000-00-00', '試用', '3', '19', '0', '0', '3');
